<script>
export default {
    setup() {
        const text = [
            {
                num: "1",
                text: "Разработка устава. Тут мы фиксируем технологию выполнения и правила проекта, периметр задачи, описываем соглашения по коммуникациям, команде, управлению рисками.",
            },
            {
                num: "2",
                text: "Составляем реестр процессов по зафиксированному периметру проекту. Интервью с каждым ключевым учатсником процессов предприятия.",
            },
            {
                num: "3",
                text: "Выделяем ключевые процессы из реестра и составляем модель «Как есть», которая включает: блок-схему процессов в нотации BPMN или удобной для заказчика, реестр по форме с описанием «Вход - Выход» процесса, общее описание деятельности. Оформляем в отчёт об обследовании «Как есть»",
            },
            {
                num: "4",
                text: "Полученную модель сравниваем в отношении трёх сторон: требованиязадачи, возможности учётной системы, лучшие практики. В результате этого анализа получаем реестр отклонений того как организованного от того как будет.",
            },
            {
                num: "5",
                text: "По каждому блоку отклонений проводим работу в части принятия решения: отстраиваем/корректируем текущий процесс или реализуем программное обеспечение.",
            },
            {
                num: "6",
                text: "На основании принятых решений формируем функциональные требования к системе и составляем техническое задание на внедрение: процессов или разработку/внедрение системы.",
            },
        ];
        return {
            text,
        };
    },
};
</script>

<template>
    <main class="d-flex flex-column align-items-center relative fs-text">
        <div class="line-decor"></div>
        <h1 class="uppercase fs-title bg-2 p-1 br-10 color-title">
            Этапы разработки
        </h1>
        <div class="d-flex align-items-center" v-for="i in text" :key="i">
            <p class="b-2 br-10 p-1" :class="{ 'opacity-0': i.num % 2 == 0 }">
                {{ i.text }}
            </p>
            <div
                class="line-horizontal-50 bg-2"
                :class="{ 'opacity-0': i.num % 2 == 0 }"
            ></div>
            <div class="br-50 bg-2 color-title square fs-title">
                {{ i.num }}
            </div>
            <div
                class="line-horizontal-50 bg-2"
                :class="{ 'opacity-0': i.num % 2 != 0 }"
            ></div>
            <p class="b-2 br-10 p-1" :class="{ 'opacity-0': i.num % 2 != 0 }">
                {{ i.text }}
            </p>
        </div>
        <p class="b-2 p-1 br-10 text-center mt-50 bg-white">
            Для удобства мы работаем двухнедельными отрезками -
            «Сессиями».Составляем дорожную карту сессий на весь проект, в каждой
            из которых указан достигаемый результат и стоимость. Таким образом
            вы получаете ожидаемый результат за понятную цену каждые две недели.
            Схема оплаты 50/50 по каждой сессии. Это означает, что на старте вы
            перечисляете 50% стоимости сессии, а по итогу выполнения сессии
            оплачиваете оставшуюся часть за выполненные услуги.
        </p>
    </main>
</template>

<style lang="scss" scoped>
.line-decor {
    position: absolute;
    width: 3px;
    height: 100%;
    z-index: -1;
    background: #d7c810;
}
</style>
